//Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
//
//645 -> 5
//78 -> третьей цифры нет
//32679 -> 6
string str =  Console.ReadLine(); 
char [] ar = str.ToCharArray;
//for (int i = 0; i < str.lenght; i++)
//{
//    Console.Write(ar[i]);
//}